"use strict";
document.write('<h1 style="color: blue;">HomeWork-18</h1>');
document.write('<h2 style="color: darkblue;">Введение в ООП</h2>');

/* Tasc №
Условие:
Реализуйте сущность Worker (Работник), который будет иметь следующие свойства: 
- name (имя), 
- surname (фамилия), 
- rate (ставка за день работы), 
- days (количество отработанных дней).
Также сущность должна иметь метод getSalary(), который будет выводить зарплату работника. 
Зарплата - это произведение (умножение) ставки rate на количество отработанных дней days.
Так же добавить несколько ролей. Администратор, Кассир, Консультант.
И добавить для каждого уникальные свойства.

Учесть все 4 принципа ООП:
Абстракция
Наследование
Полиморфизм
Инкапсуляция
Решение:
*/

