1) с помощью promt спрашиваем у пользователя что он хочет сделать (+ - / *). 
Спрашиваем до тех пор пока он введет допустимое значение



2) спрашиваем сколько операндов он хочет использовать. 
Это должно быть число больше 1. Спрашиваем пока пользователь не введет допустимое значение



3) спрашиваем у пользователя каждый операнд. Это должно быть число. Спрашиваем пока пользователь не введет допустимое значение



4) С помощью alert или console.log выводим результат действия (+ - / *) со всеми операндами